.config/emacs/README.org
#+TITLE: Emacs Config
#+AUTHOR: tralph3
#+PROPERTY: header-args :tangle init.el
#+STARTUP: showeverything

* Early Init
Here we define variables that we want emacs to read as soon as
possible. Mainly, we set variables to stop emacs from littering the
config directory with lockfiles, auto-save files, backups, or even
packages.
#+begin_src emacs-lisp :tangle early-init.el
  (setq user-emacs-directory "~/.local/share/emacs/")
  (setq user-config-directory "~/.config/emacs/")

  (setq-default startup-redirect-eln-cache user-emacs-directory)
  (setq-default create-lockfiles nil)
  (setq-default make-backup-files nil)
  (setq-default backup-inhibited t)
  (setq-default auto-save-list-file-prefix (file-name-concat user-emacs-directory "auto-saves/.saves-"))
  (setq-default custom-file (file-name-concat user-emacs-directory "custom-file"))
  (setq-default package-user-dir (file-name-concat user-emacs-directory "elpa"))
  (setq-default url-history-file (file-name-concat user-emacs-directory "url/history"))
  (setq-default lock-file-name-transforms `(("^\\(.*\\)$" "/tmp/\\1") t))
  (setq-default auto-save-default nil)
  (setq-default custom-theme-directory (file-name-concat user-emacs-directory "custom-themes"))

  (setq-default pgtk-wait-for-event-timeout 0)
#+end_src
** Performance
#+begin_src emacs-lisp :tangle early-init.el
  (setq-default gc-cons-threshold 100000000)
  (setq-default read-process-output-max (* 1024 1024))
#+end_src
* General Settings
These settings are just personal preference.
** User Interface
How I prefer emacs to look.
#+begin_src emacs-lisp
  (setq display-line-numbers-type 'visual)
  (global-display-line-numbers-mode t)
  (scroll-bar-mode 0)
  (tool-bar-mode 0)
  (menu-bar-mode 0)
  (set-face-attribute 'default nil
                      :font "Berkeley Mono-13")
  (set-face-attribute 'variable-pitch nil
                      :font "Ubuntu-13")
#+end_src
** Custom File
Load the custom file
#+begin_src emacs-lisp
  (when (file-exists-p custom-file)
    (load custom-file 'noerror 'nomessage))
#+end_src
** Behavioral Settings
How I prefer emacs to behavior.
#+begin_src emacs-lisp
  (fset 'yes-or-no-p 'y-or-n-p)
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)
  (setq inhibit-startup-screen t)
  (delete-selection-mode t)
  (electric-pair-mode t)
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
  (setq global-auto-revert-non-file-buffers t)
  (global-auto-revert-mode t)
  (setq c-default-style "stroustrup")
  (xterm-mouse-mode t)
  (setq native-comp-async-report-warnings-errors nil)
  (context-menu-mode t)
  (setq mouse-drag-and-drop-region-cross-program t)
#+end_src
*** Smooth Scrolling
Make emacs scroll smoothly with a mouse, touchpad, and scroll keys.
#+begin_src emacs-lisp
  (setq-default scroll-conservatively 10000)
  (setq-default scroll-margin 5)

  (setq pixel-scroll-precision-use-momentum t)
  (setq pixel-scroll-precision-interpolate-mice t)
  (setq pixel-scroll-precision-large-scroll-height 10.0)
  (setq pixel-scroll-precision-interpolate-page t)
  (pixel-scroll-precision-mode t)

  (global-set-key (kbd "C-v") 'pixel-scroll-interpolate-down)
  (global-set-key (kbd "M-v") 'pixel-scroll-interpolate-up)
#+end_src
*** Comfort Keybindings
#+begin_src emacs-lisp
  (defun insert-blank-line-top ()
    (interactive)
    (move-beginning-of-line nil)
    (open-line 1))

  (defun insert-blank-line-bottom ()
    (interactive)
    (move-end-of-line nil)
    (open-line 1)
    (next-line 1))

  (global-set-key (kbd "M-o") 'insert-blank-line-bottom)
  (global-set-key (kbd "M-O") 'insert-blank-line-top)

  (global-set-key (kbd "M-Z") 'zap-up-to-char)
#+end_src
*** Display Size in Milimiters Workaround
My monitor doesn't seem to report proper values to get the display
size in milimiters. These values are needed to compute the size of
numerous UI elements, such as LaTeX preview images in org files. The
functions to get these values are returning 0. For this reason, I
check if they do return 0, and then redefine the
pgtk-display-monitor-attributes-list function to calculate the values
manually.

The method to calculate the milimiter dimensions has been borrowed
from the [[https://gitlab.freedesktop.org/xorg/xserver/-/blob/f08ab719df921e1269691553daf56853380fb241/randr/rrmonitor.c#L77][Xorg source code]].
#+begin_src emacs-lisp
  (if (eq (x-display-mm-width) 0)
      (progn
        (let* ((default-pixels-per-mm (/ 96.0 25.4))
               (display-mm-width (floor (+ (/ (display-pixel-width) default-pixels-per-mm) 0.5)))
               (display-mm-height (floor (+ (/ (display-pixel-height) default-pixels-per-mm) 0.5))))
          (setq display-mm-dimensions-alist `((t . (,display-mm-width . ,display-mm-height)))))

        (defun pgtk-display-monitor-attributes-list (&optional terminal)
          (let ((display-name (frame-parameter nil 'display))
                (geometry (list 0 0 (display-pixel-width terminal)
                                (display-pixel-height terminal)))
                (mm-size (list (display-mm-width terminal)
                               (display-mm-height terminal))))
            `(((name . ,display-name)
               (geometry . ,geometry)
               (workarea . ,geometry)
               (mm-size . ,mm-size)
               (scale-factor . 1.0)
               (frames . ,(frames-on-display-list terminal))
               (source . "Gdk")))))))
#+end_src
* Packages
These are the emacs packages I use.
** Setup
Here we setup the `package-archives` variable to include the [[https://melpa.org][MELPA]]
repository.
#+begin_src emacs-lisp
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
#+end_src
** All The Icons
#+begin_src emacs-lisp
  (use-package all-the-icons
    :ensure t)
#+end_src
** Corfu
Corfu provides a quick popup that displays completion candidates for
whatever it is you're currently typing. It can also show documentation
next to the completions buffer for the symbol you're currently
selecting. Goes well with [[Orderless]].
#+begin_src emacs-lisp
  (use-package corfu
    :ensure t
    :custom
    (corfu-auto t)
    (corfu-auto-delay 0.2)
    (corfu-auto-prefix 0)
    (corfu-min-width 60)
    (corfu-popupinfo-delay 0.5)
    (corfu-preview-current nil)
    (corfu-preselect 'prompt)
    (corfu-quit-no-match t)
    (corfu-on-exact-match 'quit)
    (corfu-cycle t)
    :config
    (corfu-popupinfo-mode)
    (global-corfu-mode))
#+end_src
*** Keybinds
Corfu by default sets up the `corfu-keymap` variable which overrides
some common keybindings. I found the defaults to be obtrusive. I
defined my own keybinds. I want the completion to appear as quickly as
possible, but I don't want it to be in the way of my typing. So, I
have bound a separate set of keys to scroll the popup, since otherwise
I would be stuck scrolling the popup when I actually wanted to scroll
the document I'm working with. I have also defined custom functions
for `TAB` and `RETURN`. `TAB` should always complete either the first
completion candidate, or any other explicitly selected
candidate. `RETURN` will only autocomplete if a candidate has been
explicitly selected. This allows me to insert a newline with `RETURN`
even if the popup is present.
#+begin_src emacs-lisp
  (defun corfu-handle-tab-completion ()
    (interactive)
    (if (>= corfu--index 0)
        (corfu-complete)
      (progn
        (setq corfu--index 0)
        (corfu-complete))))

  (defun corfu-handle-return-completion ()
    (interactive)
    (if (>= corfu--index 0)
        (corfu-complete)
      (newline)))

  (setq corfu-map (make-sparse-keymap))
  (define-key corfu-map (kbd "M-n") 'corfu-next)
  (define-key corfu-map (kbd "M-p") 'corfu-previous)
  (define-key corfu-map (kbd "TAB") 'corfu-handle-tab-completion)
  (define-key corfu-map (kbd "RET") 'corfu-handle-return-completion)
  (define-key corfu-map (kbd "M-SPC") 'corfu-insert-separator)
#+end_src
*** User Interface
I like kind-icons to be shown next to the completion
candidates. Hence, this package.
#+begin_src emacs-lisp
  (use-package kind-icon
    :ensure t
    :after corfu
    :custom
    (kind-icon-default-face 'corfu-default)
    (kind-icon-blend-background nil)
    :config
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))
#+end_src
** Extra Programming Modes
These packages provide major modes for other programming languages
that are not included by default.
#+begin_src emacs-lisp
  (use-package rust-mode
    :ensure t)
#+end_src
** Vertico
Vertico provides a performant and minimalistic vertical completion UI
based on the default completion system. It makes it really easy to
search for functions or variables in the minibuffer. Goes well with
[[Orderless]].
#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :config
    (vertico-mode)
    (vertico-mouse-mode))
#+end_src
** Magit
Magit is an interface for git.
#+begin_src emacs-lisp
  (use-package magit
    :ensure t
    :bind (("C-c g" . 'magit-status)))
#+end_src
** Orderless
Orderless is a completion style that lets you search for completions
based on keywords, in any order.
#+begin_src emacs-lisp
  (use-package orderless
    :ensure t
    :config
    (add-to-list 'completion-styles 'orderless))
#+end_src
** Treemacs
Treemacs provides a nice looking tree view of the working you're
currently working with. It also provides the ability to list all
symbols on a given file, and browse it that way.
#+begin_src emacs-lisp
  (defun project-open (project-root)
    (cd project-root)
    (treemacs-add-and-display-current-project-exclusively))

  (defun open-config ()
    (interactive)
    (let ((dotfiles-dir (getenv "DOTFILES_DIR")))
      (cd (file-name-concat dotfiles-dir ".config"))
      (treemacs-select-directory)))

  (global-set-key (kbd "C-c c") 'open-config)

  (use-package treemacs
    :ensure t
    :custom
    (treemacs-read-string-input 'from-minibuffer)
    :config
    (treemacs-fringe-indicator-mode -1))
#+end_src
