.config/emacs/init.el
(setq display-line-numbers-type 'visual)
(global-display-line-numbers-mode t)
(scroll-bar-mode 0)
(tool-bar-mode 0)
(menu-bar-mode 0)
(set-face-attribute 'default nil
                    :font "JuliaMono-13")
(set-face-attribute 'variable-pitch nil
                    :font "Ubuntu-13")

(when (file-exists-p custom-file)
  (load custom-file 'noerror 'nomessage))

(fset 'yes-or-no-p 'y-or-n-p)
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)
(setq inhibit-startup-screen t)
(delete-selection-mode t)
(electric-pair-mode t)
(add-hook 'before-save-hook 'delete-trailing-whitespace)
(setq global-auto-revert-non-file-buffers t)
(global-auto-revert-mode t)
(setq c-default-style "stroustrup")
(xterm-mouse-mode t)
(setq native-comp-async-report-warnings-errors nil)
(context-menu-mode t)
(setq mouse-drag-and-drop-region-cross-program t)

(setq-default scroll-conservatively 10000)
(setq-default scroll-margin 5)

(setq pixel-scroll-precision-use-momentum t)
(setq pixel-scroll-precision-interpolate-mice t)
(setq pixel-scroll-precision-large-scroll-height 10.0)
(setq pixel-scroll-precision-interpolate-page t)
(pixel-scroll-precision-mode t)

(global-set-key (kbd "C-v") 'pixel-scroll-interpolate-down)
(global-set-key (kbd "M-v") 'pixel-scroll-interpolate-up)

(defun insert-blank-line-top ()
  (interactive)
  (move-beginning-of-line nil)
  (open-line 1))

(defun insert-blank-line-bottom ()
  (interactive)
  (move-end-of-line nil)
  (open-line 1)
  (next-line 1))

(global-set-key (kbd "M-o") 'insert-blank-line-bottom)
(global-set-key (kbd "M-O") 'insert-blank-line-top)

(global-set-key (kbd "M-Z") 'zap-up-to-char)

(if (eq (x-display-mm-width) 0)
    (progn
      (let* ((default-pixels-per-mm (/ 96.0 25.4))
             (display-mm-width (floor (+ (/ (display-pixel-width) default-pixels-per-mm) 0.5)))
             (display-mm-height (floor (+ (/ (display-pixel-height) default-pixels-per-mm) 0.5))))
        (setq display-mm-dimensions-alist `((t . (,display-mm-width . ,display-mm-height)))))

      (defun pgtk-display-monitor-attributes-list (&optional terminal)
        (let ((display-name (frame-parameter nil 'display))
              (geometry (list 0 0 (display-pixel-width terminal)
                              (display-pixel-height terminal)))
              (mm-size (list (display-mm-width terminal)
                             (display-mm-height terminal))))
          `(((name . ,display-name)
             (geometry . ,geometry)
             (workarea . ,geometry)
             (mm-size . ,mm-size)
             (scale-factor . 1.0)
             (frames . ,(frames-on-display-list terminal))
             (source . "Gdk")))))))

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(use-package all-the-icons
  :ensure t)

(use-package corfu
  :ensure t
  :custom
  (corfu-auto t)
  (corfu-auto-delay 0.2)
  (corfu-auto-prefix 0)
  (corfu-min-width 60)
  (corfu-popupinfo-delay 0.5)
  (corfu-preview-current nil)
  (corfu-preselect 'prompt)
  (corfu-quit-no-match t)
  (corfu-on-exact-match 'quit)
  (corfu-cycle t)
  :config
  (corfu-popupinfo-mode)
  (global-corfu-mode))

(defun corfu-handle-tab-completion ()
  (interactive)
  (if (>= corfu--index 0)
      (corfu-complete)
    (progn
      (setq corfu--index 0)
      (corfu-complete))))

(defun corfu-handle-return-completion ()
  (interactive)
  (if (>= corfu--index 0)
      (corfu-complete)
    (newline)))

(setq corfu-map (make-sparse-keymap))
(define-key corfu-map (kbd "M-n") 'corfu-next)
(define-key corfu-map (kbd "M-p") 'corfu-previous)
(define-key corfu-map (kbd "TAB") 'corfu-handle-tab-completion)
(define-key corfu-map (kbd "RET") 'corfu-handle-return-completion)
(define-key corfu-map (kbd "M-SPC") 'corfu-insert-separator)

(use-package kind-icon
  :ensure t
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default)
  (kind-icon-blend-background nil)
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(use-package rust-mode
  :ensure t)

(use-package vertico
  :ensure t
  :config
  (vertico-mode)
  (vertico-mouse-mode))

(use-package magit
  :ensure t
  :bind (("C-c g" . 'magit-status)))

(use-package orderless
  :ensure t
  :config
  (add-to-list 'completion-styles 'orderless))

(defun project-open (project-root)
  (cd project-root)
  (treemacs-add-and-display-current-project-exclusively))

(defun open-config ()
  (interactive)
  (let ((dotfiles-dir (getenv"DOTFILES_DIR")))
    (cd (file-name-concat dotfiles-dir "/.config"))
    (treemacs-select-directory)))

(global-set-key (kbd "C-c c") 'open-config)

(use-package treemacs
  :ensure t
  :custom
  (treemacs-read-string-input 'from-minibuffer)
  :config
  (treemacs-fringe-indicator-mode -1))
