.config/emacs/README.org
** Dashboard
Provides a nice dashboard on every new frame.
#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :after all-the-icons
    :custom
    (dashboard-set-file-icons t)
    (dashboard-set-heading-icons t)
    (dashboard-banner-logo-title "TitoMacs")
    (dashboard-center-content t)
    (dashboard-show-shortcuts t)
    (dashboard-projects-backend 'project-el)
    (dashboard-items '((recents . 5) (projects . 5) (bookmarks . 5)))
    (dashboard-startup-banner 'logo)
    (dashboard-set-navigator t)
    (dashboard-navigator-buttons
     `(((,(all-the-icons-octicon "file-text" :height 1.0 :v-adjust 0.0)
         "Emacs Config"
         "Open the Emacs config file"
         (lambda (&rest _)
           (find-file (file-name-concat user-config-directory "README.org")))))))
    (dashboard-projects-switch-function 'project-open)
    :config
    (dashboard-setup-startup-hook))
#+end_src
** Treesitter
#+begin_src emacs-lisp
  (use-package tree-sitter
    :ensure t
    :config
    (require 'tree-sitter-langs)
    (global-tree-sitter-mode)
    (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

  (use-package tree-sitter-langs
    :ensure t
    :after tree-sitter)
#+end_src
** Which Key
Which Key provides a list of possible keys to type and to which
functions they are bound when you're in the middle of typing a
key-chord. Can be useful to learn new packages or discover new
functionality.
#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :custom
    (which-key-idle-delay 0.2)
    :config
    (which-key-mode))
#+end_src
** Marginalia
Adds annotations to completion candidates.
#+begin_src emacs-lisp
  (use-package marginalia
    :ensure t
    :config
    (marginalia-mode))
#+end_src
** Org Roam
#+begin_src emacs-lisp
  (setq zettelkasten-paths-alist '(("Main" . "~/Documents/wiki/")
                                   ("NesWiki" . "~/Documents/NesWiki/")))

  (defun switch-zettelkasten ()
    (interactive)
    (let* ((keys (mapcar #'car zettelkasten-paths-alist))
           (prompt (format "Select Zettelkasten:"))
           (key (completing-read prompt keys))
           (chosen-zettelkasten-path (cdr (assoc key zettelkasten-paths-alist))))
      (setq org-roam-directory chosen-zettelkasten-path)
      (setq org-roam-db-location (file-name-concat chosen-zettelkasten-path "org-roam.db"))
      (org-roam-db-sync)))

  (use-package org-roam
    :ensure t
    :custom
    (org-roam-directory (cdr (assoc-string "Main" zettelkasten-paths-alist)))
    (org-roam-db-location (file-name-concat (cdr (assoc-string "Main" zettelkasten-paths-alist)) "org-roam.db"))
    (org-roam-capture-templates '(("d" "default" plain "%?"
                                    :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                                                       "#+title: ${title}\n#+filetags: :Unfinished:")
                                    :unnarrowed t)))
    :bind
    (("C-c n f" . org-roam-node-find)
     ("C-c n s" . switch-zettelkasten)
     (:map org-mode-map
           (("C-c n i" . org-roam-node-insert)
            ("C-c n t" . org-roam-tag-add)
            ("C-c n a" . org-roam-alias-add)
            ("C-c n b" . org-roam-buffer-toggle))))
    :config
    (org-roam-db-autosync-mode t))

  (use-package org-roam-ui
    :ensure t
    :custom
    (org-roam-ui-open-on-start nil)
    (org-roam-ui-sync-theme nil))
#+end_src
** Org Superstar
#+begin_src emacs-lisp
  (use-package org-superstar
    :ensure t
    :custom
    (org-superstar-item-bullet-alist '((42 . 8226)
                                       (43 . 8226)
                                       (45 . 8211)))
    :config
    (add-hook 'org-mode-hook 'org-superstar-mode)
    (org-superstar-mode t))
#+end_src
** Org Fragtog
Org Fragtog allows me to seamlessly edit latex previews in org
documents whenever the point is over them.
#+begin_src emacs-lisp
  (use-package org-fragtog
    :ensure t
    :config
    (add-hook 'org-mode-hook 'org-fragtog-mode))
#+end_src
** Undo Tree
#+begin_src emacs-lisp
  (use-package undo-tree
    :ensure t
    :custom
    (undo-tree-history-directory-alist `(("." . ,(file-name-concat user-emacs-directory "undo-tree"))))
    :config
    (global-undo-tree-mode))
#+end_src
** Dirvish
Dirvish is a more polished dired. It's still dired, but it looks and
behaves nicer.
#+begin_src emacs-lisp
  (use-package dirvish
    :ensure t
    :init
    (dirvish-override-dired-mode t)
    :custom
    (dired-mouse-drag-files t)
    (dired-listing-switches "-lA --group-directories-first --human-readable")
    (dirvish-attributes '(vc-state subtree-state all-the-icons collapse file-time file-size))
    :config
    (dirvish-side-follow-mode t)
    :bind
    (:map dirvish-mode-map
          ("<mouse-1>" . dirvish-subtree-toggle-or-open)
          ("<mouse-2>" . dired-mouse-find-file-other-window)
          ("a"   . dirvish-quick-access)
          ("f"   . dirvish-file-info-menu)
          ("y"   . dirvish-yank-menu)
          ("N"   . dirvish-narrow)
          ("^"   . dirvish-history-last)
          ("h"   . dirvish-history-jump)
          ("s"   . dirvish-quicksort)
          ("v"   . dirvish-vc-menu)
          ("TAB" . dirvish-subtree-toggle)
          ("M-f" . dirvish-history-go-forward)
          ("M-b" . dirvish-history-go-backward)
          ("M-l" . dirvish-ls-switches-menu)
          ("M-m" . dirvish-mark-menu)
          ("M-t" . dirvish-layout-toggle)
          ("M-s" . dirvish-setup-menu)
          ("M-e" . dirvish-emerge-menu)
          ("M-j" . dirvish-fd-jump)))
#+end_src
* Colorscheme
:PROPERTIES:
:header-args: :tangle (file-name-concat custom-theme-directory "system-theme-theme.el")
:END:
I don't use any specific colorscheme. Instead, I have a system that
applies a certain colorscheme to many programs at once. The
colorscheme defines some variables, and each program uses these
variables in its own way. For emacs, I first need to load these
variables by loading the [[file:~/.config/colorschemes/current_colorscheme/colors.el][colors.el]] file.
#+begin_src emacs-lisp :tangle init.el
  (defun reload-colorscheme ()
    (interactive)
    (load "~/.config/colorschemes/current_colorscheme/colors.el" 'noerror 'nomessage)
    (load-theme 'system-theme t)
    (treemacs-realign-icon-colors)
    (setq org-roam-ui-custom-theme
          `((bg . ,BACKGROUND_1)
            (bg-alt . ,BACKGROUND_2)
            (fg . ,FOREGROUND_1)
            (fg-alt . ,FOREGROUND_2)
            (red . ,RED)
            (orange . ,ORANGE)
            (yellow . ,YELLOW)
            (green . ,GREEN)
            (cyan . ,CYAN)
            (blue . ,BLUE)
            (violet . ,PINK)
            (magenta . ,MAGENTA)))
    (ignore-errors
      (org-roam-ui-sync-theme)))

  (define-key special-event-map [sigusr1] 'reload-colorscheme)
  (reload-colorscheme)
#+end_src
** Colorscheme Setup
Here we define the colorscheme and the first part of the mechanism to
set the faces.
#+begin_src emacs-lisp
(deftheme system-theme
  "Synchronizes colors with the system theme.")
(let ((faces `(
#+end_src
** Basic Colors
#+begin_src emacs-lisp
  (default :foreground ,FOREGROUND_1
           :background ,BACKGROUND_1)
  (fringe :foreground ,FOREGROUND_1
          :background ,BACKGROUND_1)
  (cursor :foreground ,FOREGROUND_2)
#+end_src
** Headerline
#+begin_src emacs-lisp
  (header-line :background ,BACKGROUND_2
               :foreground ,FOREGROUND_2)
#+end_src
** Modeline
#+begin_src emacs-lisp
  (mode-line :background ,BACKGROUND_2
             :foreground ,FOREGROUND_2
             :box nil)
  (mode-line-highlight :background ,HIGHLIGHT_BG
                       :foreground ,HIGHLIGHT_FG
                       :box nil)
  (mode-line-inactive :background ,INACTIVE)
#+end_src
** Corfu
#+begin_src emacs-lisp
  (corfu-default :background ,BACKGROUND_2
                 :foreground ,FOREGROUND_2)
#+end_src
** Org Mode
#+begin_src emacs-lisp
  (org-block :background ,BACKGROUND_2 :extend t)
  (org-block-begin-line :background ,BACKGROUND_2
                        :foreground ,COMMENT
                        :slant italic
                        :extend t)
  (org-block-end-line :background ,BACKGROUND_2
                      :foreground ,COMMENT
                      :slant italic
                      :extend t)
  (org-hide :foreground ,COMMENT)
  (org-level-1 :height 1.5 :weight bold)
  (org-level-2 :height 1.3 :weight bold)
  (org-level-3 :height 1.1 :weight bold)
  (org-level-4 :weight normal)
  (org-level-5 :weight normal)
  (org-level-6 :weight normal)
  (org-level-7 :weight normal)
  (org-level-8 :weight normal)
#+end_src
** Programming
*** Comments
#+begin_src emacs-lisp
  (font-lock-comment-face :foreground ,COMMENT
                          :slant italic)
  (font-lock-comment-delimiter-face :inherit 'font-lock-comment-face)
  (tree-sitter-hl-face:comment :inherit font-lock-comment-face)
#+end_src
*** Keywords
#+begin_src emacs-lisp
  (font-lock-keyword-face :foreground ,KEYWORD)
  (tree-sitter-hl-face:keyword :inherit 'font-lock-keyword-face)
#+end_src
*** Operators
#+begin_src emacs-lisp
  (font-lock-operator-face :foreground ,OPERATOR)
  (tree-sitter-hl-face:operator :inherit 'font-lock-operator-face)
#+end_src
*** Strings
#+begin_src emacs-lisp
  (font-lock-string-face :foreground ,STRING)
  (tree-sitter-hl-face:string :inherit 'font-lock-string-face)
#+end_src
*** Builtins
#+begin_src emacs-lisp
  (font-lock-builtin-face :foreground ,BUILTIN)
  (tree-sitter-hl-face:constant.builtin :inherit 'font-lock-builtin-face)
  (tree-sitter-hl-face:function.builtin :inherit 'font-lock-builtin-face)
#+end_src
*** Numbers
#+begin_src emacs-lisp
  (font-lock-number-face :foreground ,NUMBER)
  (tree-sitter-hl-face:number :foreground ,NUMBER)
#+end_src
*** Variables
#+begin_src emacs-lisp
  (font-lock-variable-use-face :foreground ,VARIABLE)
  (font-lock-variable-name-face :foreground ,VARIABLE)
  (tree-sitter-hl-face:variable :foreground ,VARIABLE)
  (tree-sitter-hl-face:variable.parameter :inherit 'tree-sitter-hl-face:variable
                                          :weight normal)
#+end_src
*** Functions
#+begin_src emacs-lisp
  (font-lock-function-name-face :foreground ,FUNCTION)
  (font-lock-function-call-face :foreground ,FUNCTION
                                :slant italic)
  (tree-sitter-hl-face:function :inherit 'font-lock-function-name-face)
  (tree-sitter-hl-face:function.call :inherit 'font-lock-function-call-face)
#+end_src
*** Methods
#+begin_src emacs-lisp
  (tree-sitter-hl-face:method :foreground ,METHOD)
  (tree-sitter-hl-face:method.call :slant italic
                                   :foreground ,METHOD)
#+end_src
*** Classes
#+begin_src emacs-lisp
  (tree-sitter-hl-face:constructor :foreground ,CLASS)
#+end_src
*** Attributes
#+begin_src emacs-lisp
  (tree-sitter-hl-face:property :foreground ,ATTRIBUTE)
  (tree-sitter-hl-face:attribute :foreground ,ATTRIBUTE)
#+end_src
