.config/emacs/init.el

(use-package dashboard
  :ensure t
  :after all-the-icons
  :custom
  (dashboard-set-file-icons t)
  (dashboard-set-heading-icons t)
  (dashboard-banner-logo-title "TitoMacs")
  (dashboard-center-content t)
  (dashboard-show-shortcuts t)
  (dashboard-projects-backend 'project-el)
  (dashboard-items '((recents . 5) (projects . 5) (bookmarks . 5)))
  (dashboard-startup-banner 'logo)
  (dashboard-set-navigator t)
  (dashboard-navigator-buttons
   `(((,(all-the-icons-octicon "file-text" :height 1.0 :v-adjust 0.0)
       "Emacs Config"
       "Open the Emacs config file"
       (lambda (&rest _)
         (find-file (file-name-concat user-config-directory "README.org")))))))
  (dashboard-projects-switch-function 'project-open)
  :config
  (dashboard-setup-startup-hook))

(use-package tree-sitter
  :ensure t
  :config
  (require 'tree-sitter-langs)
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

(use-package tree-sitter-langs
  :ensure t
  :after tree-sitter)

(use-package which-key
  :ensure t
  :custom
  (which-key-idle-delay 0.2)
  :config
  (which-key-mode))

(use-package marginalia
  :ensure t
  :config
  (marginalia-mode))

(setq zettelkasten-paths-alist '(("Main" . "~/Documents/wiki/")
                                 ("NesWiki" . "~/Documents/NesWiki/")))

(defun switch-zettelkasten ()
  (interactive)
  (let* ((keys (mapcar #'car zettelkasten-paths-alist))
         (prompt (format "Select Zettelkasten:"))
         (key (completing-read prompt keys))
         (chosen-zettelkasten-path (cdr (assoc key zettelkasten-paths-alist))))
    (setq org-roam-directory chosen-zettelkasten-path)
    (setq org-roam-db-location (file-name-concat chosen-zettelkasten-path "org-roam.db"))
    (org-roam-db-sync)))

(use-package org-roam
  :ensure t
  :custom
  (org-roam-directory (cdr (assoc-string "Main" zettelkasten-paths-alist)))
  (org-roam-db-location (file-name-concat (cdr (assoc-string "Main" zettelkasten-paths-alist)) "org-roam.db"))
  (org-roam-capture-templates '(("d" "default" plain "%?"
                                  :target (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                                                     "#+title: ${title}\n#+filetags: :Unfinished:")
                                  :unnarrowed t)))
  :bind
  (("C-c n f" . org-roam-node-find)
   ("C-c n s" . switch-zettelkasten)
   (:map org-mode-map
         (("C-c n i" . org-roam-node-insert)
          ("C-c n t" . org-roam-tag-add)
          ("C-c n a" . org-roam-alias-add)
          ("C-c n b" . org-roam-buffer-toggle))))
  :config
  (org-roam-db-autosync-mode t))

(use-package org-roam-ui
  :ensure t
  :custom
  (org-roam-ui-open-on-start nil)
  (org-roam-ui-sync-theme nil))

(use-package org-superstar
  :ensure t
  :custom
  (org-superstar-item-bullet-alist '((42 . 8226)
                                     (43 . 8226)
                                     (45 . 8211)))
  :config
  (add-hook 'org-mode-hook 'org-superstar-mode)
  (org-superstar-mode t))

(use-package org-fragtog
  :ensure t
  :config
  (add-hook 'org-mode-hook 'org-fragtog-mode))

(use-package undo-tree
  :ensure t
  :custom
  (undo-tree-history-directory-alist `(("." . ,(file-name-concat user-emacs-directory "undo-tree"))))
  :config
  (global-undo-tree-mode))

(use-package dirvish
  :ensure t
  :init
  (dirvish-override-dired-mode t)
  :custom
  (dired-mouse-drag-files t)
  (dired-listing-switches "-lA --group-directories-first --human-readable")
  (dirvish-attributes '(vc-state subtree-state all-the-icons collapse file-time file-size))
  :config
  (dirvish-side-follow-mode t)
  :bind
  (:map dirvish-mode-map
        ("<mouse-1>" . dirvish-subtree-toggle-or-open)
        ("<mouse-2>" . dired-mouse-find-file-other-window)
        ("a"   . dirvish-quick-access)
        ("f"   . dirvish-file-info-menu)
        ("y"   . dirvish-yank-menu)
        ("N"   . dirvish-narrow)
        ("^"   . dirvish-history-last)
        ("h"   . dirvish-history-jump)
        ("s"   . dirvish-quicksort)
        ("v"   . dirvish-vc-menu)
        ("TAB" . dirvish-subtree-toggle)
        ("M-f" . dirvish-history-go-forward)
        ("M-b" . dirvish-history-go-backward)
        ("M-l" . dirvish-ls-switches-menu)
        ("M-m" . dirvish-mark-menu)
        ("M-t" . dirvish-layout-toggle)
        ("M-s" . dirvish-setup-menu)
        ("M-e" . dirvish-emerge-menu)
        ("M-j" . dirvish-fd-jump)))

(defun reload-colorscheme ()
  (interactive)
  (load "~/.config/colorschemes/current_colorscheme/colors.el" 'noerror 'nomessage)
  (load (file-name-concat user-config-directory "colorscheme.el") 'noerror 'nomessage)
  (treemacs-realign-icon-colors)
  (ignore-errors
    (org-roam-ui-sync-theme)))

(define-key special-event-map [sigusr1] 'reload-colorscheme)
(reload-colorscheme)

(require 'eglot)
