.config/emacs/README.org
*** Parameters
#+begin_src emacs-lisp
  (font-lock-type-face :foreground ,PARAMETER)
  (tree-sitter-hl-face:type.parameter :foreground ,PARAMETER)
  (tree-sitter-hl-face:type.argument :foreground ,PARAMETER
                                     :slant italic)
#+end_src
*** Types
#+begin_src emacs-lisp
  (font-lock-constant-face :foreground ,TYPE)
  (tree-sitter-hl-face:type :foreground ,TYPE)
  (tree-sitter-hl-face:constant :foreground ,TYPE)
#+end_src
*** Misc
#+begin_src emacs-lisp
  (tree-sitter-hl-face:escape :inherit 'font-lock-string
                              :foreground ,KEYWORD)
  (show-paren-match :foreground ,HIGHLIGHT_FG
                    :background ,HIGHLIGHT_BG)
#+end_src

#+begin_src emacs-lisp

  (shadow :foreground ,COMMENT)
  (font-lock-doc-face :inherit 'font-lock-comment-face)
  (link :foreground ,CYAN
        :underline t)
  (link-visited :foreground ,MAGENTA
                :underline t)

  (font-lock-negation-char-face :inherit 'font-lock-operator-face)
  (font-lock-preprocessor-face :foreground ,ORANGE)

  (line-number :foreground ,COMMENT)
  (line-number-current-line :foreground ,FOREGROUND_1)

  (tree-sitter-hl-face:constant :inherit 'font-lock-constant-face)



  (warning :foreground ,ORANGE)
  (font-lock-warning-face :inherit 'warning)


  (tree-sitter-hl-face:variable.parameter :foreground ,PARAMETER)
  (region :foreground ,HIGHLIGHT_FG
          :background ,HIGHLIGHT_BG
          :weight bold)
  (mode-line-highlight :foreground ,HIGHLIGHT_FG
                       :background ,HIGHLIGHT_BG)

  (window-divider :foreground ,INACTIVE)
  (vertical-border :foreground ,INACTIVE)


  (show-paren-match :background ,ACCENT)
  (highlight :foreground ,HIGHLIGHT_FG
             :background ,HIGHLIGHT_BG)
  (hl-line :foreground ,HIGHLIGHT_FG
           :background ,HIGHLIGHT_BG)
  (error :foreground ,RED)
  (flymake-error :underline (:color ,RED :style wave))
  (flymake-warning :underline (:color ,ORANGE :style wave))
  (flymake-note :underline (:color ,BLUE :style wave))
  (warning :foreground ,ORANGE)
  (tree-sitter-hl-face:label :foreground ,PARAMETER)
  (minibuffer-prompt :foreground ,ACCENT)
  (success :foreground ,GREEN)
  (compilation-error :foreground ,RED)
  (compilation-warning :foreground ,ORANGE)
  (compilation-info :foreground ,BLUE)
  (compilation-mode-line-fail :foreground ,RED)
  (compilation-mode-line-exit :foreground ,GREEN)
  (compilation-mode-line-run :foreground ,ORANGE)

  (tty-menu-disabled-face :foreground ,INACTIVE
                          :background ,BACKGROUND_2)
  (tty-menu-selected-face :foreground ,HIGHLIGHT_FG
                          :background ,HIGHLIGHT_BG)
  (tty-menu-enabled-face :foreground ,FOREGROUND_2
                         :background ,BACKGROUND_2)
  (treemacs-window-background-face :background ,BACKGROUND_2)
  (treemacs-hl-line-face :background ,HIGHLIGHT_BG
                         :foreground ,HIGHLIGHT_FG)
#+end_src
** Colorscheme Setup End
Here's the second part of the mechanism to set the faces, after all
the faces have been defined.
#+begin_src emacs-lisp
               ))) ; this closes the faces list and the first argument of let
  (dolist (face-definition faces)
    (let ((face (car face-definition))
          (attributes (cdr face-definition)))
      (custom-theme-set-faces
       'system-theme
       `(,face ((t (,@attributes)))))
      (custom-theme-recalc-face face))))

(provide-theme 'system-theme)
#+end_src
* Eglot
Eglot is a minimalistic LSP client. It integrates very well with
emacs, using its built-in tools as much as possible.
#+begin_src emacs-lisp
  (require 'eglot)
  (setq eglot-autoshutdown t)
  (setq eglot-sync-connect 0)
  (define-key eglot-mode-map (kbd "C-c r") 'eglot-rename)
  (global-set-key (kbd "C-c d") 'xref-find-definitions)
  (global-set-key (kbd "C-c h") 'eldoc)
  (global-set-key (kbd "C-c b") 'xref-go-back)
  (global-set-key (kbd "C-c R") 'xref-find-references)
  (add-hook 'prog-mode-hook 'eglot-ensure)
#+end_src
* Org Mode
** General Settings
#+begin_src emacs-lisp
  (require 'org-tempo)
  (setq org-startup-indented t)
  (setq org-pretty-entities t)
  (setq org-hide-emphasis-markers t)
  (setq org-startup-with-inline-images t)
  (setq org-preview-latex-default-process 'dvisvgm)
  (setq org-preview-latex-image-directory "~/.cache/ltximg")
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 1.4))
  (setq org-startup-with-latex-preview t)
  (add-hook 'org-mode-hook 'auto-fill-mode)
  (add-hook 'org-mode-hook 'flyspell-mode)
#+end_src
* Doc View Mode
** General Settings
#+begin_src emacs-lisp
  (add-hook 'doc-view-mode-hook (lambda () (display-line-numbers-mode -1)))
  (add-hook 'doc-view-mode-hook (lambda () (pixel-scroll-precision-mode -1)))
  (setq doc-view-scale-internally t)
  (setq doc-view-continuous t)
#+end_src
