.config/emacs/init.el
(setq eglot-autoshutdown t)
(setq eglot-sync-connect 0)
(define-key eglot-mode-map (kbd "C-c r") 'eglot-rename)
(global-set-key (kbd "C-c d") 'xref-find-definitions)
(global-set-key (kbd "C-c h") 'eldoc)
(global-set-key (kbd "C-c b") 'xref-go-back)
(global-set-key (kbd "C-c R") 'xref-find-references)
(add-hook 'prog-mode-hook 'eglot-ensure)

(require 'org-tempo)
(setq org-startup-indented t)
(setq org-pretty-entities t)
(setq org-hide-emphasis-markers t)
(setq org-startup-with-inline-images t)
(setq org-preview-latex-default-process 'dvisvgm)
(setq org-preview-latex-image-directory "~/.cache/ltximg")
(setq org-format-latex-options (plist-put org-format-latex-options :scale 1.4))
(setq org-startup-with-latex-preview t)
(add-hook 'org-mode-hook 'auto-fill-mode)

(add-hook 'doc-view-mode-hook (lambda () (display-line-numbers-mode -1)))
(add-hook 'doc-view-mode-hook (lambda () (pixel-scroll-precision-mode -1)))
(setq doc-view-scale-internally t)
(setq doc-view-continuous t)
